# Exercises: 

## 1. Attendance Data

 Load the attendance.csv file and calculate an attendnace percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

    
## 2. Coffee Levels

Read the coffee_levels.csv file.
Transform the data so that each carafe is in it's own column.
Is this the best shape for the data?


## 3. Cake Recipes

Read the cake_recipes.csv data. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
Tidy the data as necessary.
Which recipe, on average, is the best? recipe b
Which oven temperature, on average, produces the best results? 275
Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

In [2]:
# Imports
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data

In [120]:
# 1. Attendance Data: Load the attendance.csv file
attendance_df= pd.read_csv('untidy-data/attendance.csv')

In [121]:
attendance_df

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [122]:
attendance_df.shape

(4, 9)

In [86]:
# calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.
attendance_long= attendance_df.melt(id_vars= ['Unnamed: 0'], var_name='date', value_name='attendance')

In [123]:
attendance_long.head()

  Student        date  score_attendance
0   Sally  2018-01-01               1.0
1    Jane  2018-01-01               0.0
2   Billy  2018-01-01               0.0
3    John  2018-01-01               1.0
4   Sally  2018-01-02               0.9

In [124]:
#changing column names
attendance_long.columns = ['Student', 'date', 'attendance']

attendance_long.head()

  Student        date  attendance
0   Sally  2018-01-01         1.0
1    Jane  2018-01-01         0.0
2   Billy  2018-01-01         0.0
3    John  2018-01-01         1.0
4   Sally  2018-01-02         0.9

In [125]:
#making dictionary to insert as new column and be able to calculate
score_attendance= {
    'P': 1,
    'H': 0.5,
    'T': 0.9,
    'A': 0,
}

In [126]:
score_attendance #looking at dictionary made

{'P': 1, 'H': 0.5, 'T': 0.9, 'A': 0}

In [127]:
#Using .map function to change each letter in attendance to its value in the dictionary
attendance_long['score_attendance'] =attendance_long.attendance.map(score_attendance)

In [128]:
attendance_long.head() # Looking at new score_attendance column added

  Student        date  attendance  score_attendance
0   Sally  2018-01-01         1.0               NaN
1    Jane  2018-01-01         0.0               NaN
2   Billy  2018-01-01         0.0               NaN
3    John  2018-01-01         1.0               NaN
4   Sally  2018-01-02         0.9               NaN

In [129]:
attendance_long.drop(columns= 'attendance', inplace= True) # drop the attendance column, no longer needed

In [130]:
attendance_long.groupby("Student").score_attendance.mean() #calculate the mean for each student to get percentage of their attendance

Student
Billy   NaN
Jane    NaN
John    NaN
Sally   NaN
Name: score_attendance, dtype: float64

In [131]:
# 2. Coffee Levels
# Read the coffee_levels.csv file.
coffee_df= pd.read_csv('untidy-data/coffee_levels.csv')

In [132]:
coffee_df.head() #Looking at first 5 values & looking at overview of data

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

In [133]:
# Transform the data so that each carafe is in it's own column.
coffee_wide= coffee_df.pivot_table(index='hour',
                                      columns='coffee_carafe',
                                      values= 'coffee_amount')

In [134]:
coffee_wide #Looking at new dataframe made

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947
13             0.310711  0.997464  0.398520
14             0.507288  0.058361  0.864464
15             0.215043  0.144644  0.436364
16             0.183891  0.544676  0.280621
17             0.391560  0.594126  0.436677

- Is this the best shape for the data?

This new shape is easier for the human eye to read.

In [145]:
## 3. Cake Recipes
# Read the cake_recipes.csv data. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
cakes_df= pd.read_csv('untidy-data/cake_recipes.csv')

In [146]:
cakes_df.head() # Looking at first 5 value

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084

In [147]:
cakes_df.info() #Looking at data types in dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   recipe:position  8 non-null      object
 1   225              8 non-null      float64
 2   250              8 non-null      float64
 3   275              8 non-null      float64
 4   300              8 non-null      float64
dtypes: float64(4), object(1)
memory usage: 448.0+ bytes

In [161]:
# 3b. Tidy the data as necessary.
cakes_long= cakes_df.melt(id_vars= ['recipe:position'], var_name='temp', value_name='value')

In [149]:
cakes_long.head()

  recipe:position temp      value
0        a:bottom  225  61.738655
1           a:top  225  51.709751
2        b:bottom  225  57.095320
3           b:top  225  82.455004
4        c:bottom  225  96.470207

In [ ]:
# 3c. Which recipe, on average, is the best? recipe b

In [159]:
#splitting recipe and position to two columns
rec_and_pos_df= cakes_long['recipe:position'].str.split(':', expand= True)

In [160]:
#renaming columns
rec_and_pos_df.columns = ['recipe', 'position']

In [162]:
rec_and_pos_df.head() # Looking to see if columns renamed

  recipe position
0      a   bottom
1      a      top
2      b   bottom
3      b      top
4      c   bottom

In [181]:
#combining melted dataframe with rec_and_pos dataframe
new_cake_df= pd.concat([rec_and_pos_df, cakes_long], axis=1).drop(columns='recipe:position')

In [182]:
new_cake_df.head() #looking at new dataframe (first 5 values)

  recipe position temp      value
0      a   bottom  225  61.738655
1      a      top  225  51.709751
2      b   bottom  225  57.095320
3      b      top  225  82.455004
4      c   bottom  225  96.470207

In [183]:
#Create pivot table for new_cake_df
cake_pivot= new_cake_df.pivot_table(index=['recipe', 'position'], columns='temp')

In [184]:
cake_pivot.head()

                     value
temp                   225        250        275        300
recipe position
a      bottom    61.738655  53.912627  74.414730  98.786784
       top       51.709751  52.009735  68.576858  50.228470
b      bottom    57.095320  61.904369  61.196980  99.248541
       top       82.455004  95.224151  98.594881  58.169349
c      bottom    96.470207  52.001358  92.893227  65.473084

In [185]:
#making temp a column
cake_pivot.columns.name= ' '
cake_pivot.reset_index(inplace= True)

In [186]:
cake_pivot.head()

     recipe position      value
temp                        225        250        275        300
0         a   bottom  61.738655  53.912627  74.414730  98.786784
1         a      top  51.709751  52.009735  68.576858  50.228470
2         b   bottom  57.095320  61.904369  61.196980  99.248541
3         b      top  82.455004  95.224151  98.594881  58.169349
4         c   bottom  96.470207  52.001358  92.893227  65.473084

In [194]:
#created another pivot table with no column alteration to be able to use here
cake_pivot2= new_cake_df.pivot_table(index=['recipe', 'position'], columns='temp')

In [211]:
cake_pivot2 # looking at cake_pivot2 dataframe

                     value
temp                   225        250        275        300
recipe position
a      bottom    61.738655  53.912627  74.414730  98.786784
       top       51.709751  52.009735  68.576858  50.228470
b      bottom    57.095320  61.904369  61.196980  99.248541
       top       82.455004  95.224151  98.594881  58.169349
c      bottom    96.470207  52.001358  92.893227  65.473084
       top       71.306308  82.795477  92.098049  53.960273
d      bottom    52.799753  58.670419  51.747686  56.183110
       top       96.873178  76.101363  59.571620  50.971626

In [195]:
#This takes the mean of top and bottom for each recipe
cake_rec= cake_pivot2.groupby('recipe').mean()

In [196]:
cake_rec

            value
temp          225        250        275        300
recipe
a       56.724203  52.961181  71.495794  74.507627
b       69.775162  78.564260  79.895930  78.708945
c       83.888258  67.398417  92.495638  59.716678
d       74.836465  67.385891  55.659653  53.577368

In [197]:
#This transposes(switch col and rows) cake_rec and takes the mean of each recipe 
cake_rec.T.mean()

recipe
a    63.922201
b    76.736074
c    75.874748
d    62.864844
dtype: float64

In [200]:
# 3d. Which oven temperature, on average, produces the best results? 275
cake_oven= cake_rec.mean()

In [201]:
#Answer: Average for each oven temperature
cake_oven

       temp
value  225     71.306022
       250     66.577437
       275     74.886754
       300     66.627655
dtype: float64

In [209]:
# 3e. Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees
new_cake_df[new_cake_df['value'] == new_cake_df['value'].max()]

   recipe position temp      value
26      b   bottom  300  99.248541

Note: used masking here to get answer